sugarcrm-connector-test/src/test/resources/artifacts/ESB/config/soapRequests/sugarcrm/setEntryList.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:sug="wso2.connector.sugarcrm.setentry">
   <soapenv:Header/>
   <soapenv:Body>
   	 <sug:sugarcrmUrl>https://gogqcl5763.trial.sugarcrm.eu//soap.php</sug:sugarcrmUrl>
   	 <sug:sessionId>2qktfs6mumoqs2vdbgbe74dsl7</sug:sessionId>
   	 <sug:moduleName>Calls</sug:moduleName>
   	 <sug:nameValueLists>
   	 	<name_value_list>
            <name_value>
		    <name>name</name>
		    <value>553232</value>
	       </name_value>
	     </name_value_list>
	     <name_value_list>
	       <name_value>
		    <name>name</name>
		    <value>443232</value>
	       </name_value>
	     </name_value_list>
      </sug:nameValueLists>   	
   </soapenv:Body>
</soapenv:Envelope>